package service

//1. тесты на метод GetMainReport:
//1.1. Успешная работа метода
//1.2. Метод возвращает ошибку - мерчант не найден
//1.3. Метод возвращает ошибку по результату попытки сфромировать отчет

//2. тесты на метод GetDashboardRevenueDynamicsReportResponse:
//2.1. Успешная работа метода
//2.2. Метод возвращает ошибку - мерчант не найден
//2.3. Метод возвращает ошибку по результату попытки сфромировать отчет

//3. тесты на метод GetBaseReport:
//3.1. Успешная работа метода
//3.2. Метод возвращает ошибку - мерчант не найден
//3.3. Метод возвращает ошибку по результату попытки сфромировать отчет
